; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l12_p12_c12_g12)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 medicina)
	(at-box box7 deposito)
	(box-has box7 medicina)
	(at-box box8 deposito)
	(box-has box8 medicina)
	(at-box box9 deposito)
	(box-has box9 medicina)
	(at-box box10 deposito)
	(box-has box10 medicina)
	(at-box box11 deposito)
	(box-has box11 medicina)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-person person1 refugio4)
	(at-person person2 refugio2)
	(at-person person3 refugio2)
	(at-person person4 refugio2)
	(at-person person5 refugio5)
	(at-person person6 refugio8)
	(at-person person7 refugio5)
	(at-person person8 refugio5)
	(at-person person9 refugio12)
	(at-person person10 refugio4)
	(at-person person11 refugio9)
	(at-person person12 refugio2)
)

(:goal (and
	(person-has person1 comida)
	(person-has person1 medicina)
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person5 medicina)
	(person-has person6 comida)
	(person-has person6 medicina)
	(person-has person10 comida)
	(person-has person10 medicina)
	(person-has person11 comida)
	(person-has person11 medicina)
	(person-has person12 medicina)
))
)

; plan
1. (pick box5 deposito dron1-der dron1)
   deleted: (at-box box5 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box5)
   goals met: 0 of 12
2. (pick box12 deposito dron1-izq dron1)
   deleted: (at-box box12 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box12)
   goals met: 0 of 12
3. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 0 of 12
4. (leave box12 refugio5 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box12) (box-has box12 medicina)
   added: (at-box box12 refugio5) (free dron1-izq) (person-has person5 medicina)
   goals met: 1 of 12
5. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 1 of 12
6. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 1 of 12
7. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 1 of 12
8. (leave box5 refugio8 dron1-der dron1 person6 comida)
   deleted: (carrying dron1 dron1-der box5) (box-has box5 comida)
   added: (at-box box5 refugio8) (free dron1-der) (person-has person6 comida)
   goals met: 2 of 12
9. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 2 of 12
10. (pick box4 deposito dron1-der dron1)
   deleted: (at-box box4 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box4)
   goals met: 2 of 12
11. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 2 of 12
12. (leave box11 refugio8 dron1-izq dron1 person6 medicina)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 medicina)
   added: (at-box box11 refugio8) (free dron1-izq) (person-has person6 medicina)
   goals met: 3 of 12
13. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 3 of 12
14. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 3 of 12
15. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 3 of 12
16. (leave box4 refugio4 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box4) (box-has box4 comida)
   added: (at-box box4 refugio4) (free dron1-der) (person-has person1 comida)
   goals met: 4 of 12
17. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 4 of 12
18. (pick box3 deposito dron1-der dron1)
   deleted: (at-box box3 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box3)
   goals met: 4 of 12
19. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 4 of 12
20. (leave box10 refugio4 dron1-izq dron1 person1 medicina)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 medicina)
   added: (at-box box10 refugio4) (free dron1-izq) (person-has person1 medicina)
   goals met: 5 of 12
21. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 5 of 12
22. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 5 of 12
23. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 5 of 12
24. (leave box3 refugio4 dron1-der dron1 person10 comida)
   deleted: (carrying dron1 dron1-der box3) (box-has box3 comida)
   added: (at-box box3 refugio4) (free dron1-der) (person-has person10 comida)
   goals met: 6 of 12
25. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 6 of 12
26. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 6 of 12
27. (move deposito refugio4 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio4)
   goals met: 6 of 12
28. (leave box9 refugio4 dron1-izq dron1 person10 medicina)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 medicina)
   added: (at-box box9 refugio4) (free dron1-izq) (person-has person10 medicina)
   goals met: 7 of 12
29. (move refugio4 deposito dron1)
   deleted: (at-dron dron1 refugio4)
   added: (at-dron dron1 deposito)
   goals met: 7 of 12
30. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 7 of 12
31. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 7 of 12
32. (leave box2 refugio9 dron1-der dron1 person11 comida)
   deleted: (carrying dron1 dron1-der box2) (box-has box2 comida)
   added: (at-box box2 refugio9) (free dron1-der) (person-has person11 comida)
   goals met: 8 of 12
33. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 8 of 12
34. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 8 of 12
35. (move deposito refugio9 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio9)
   goals met: 8 of 12
36. (move refugio9 refugio2 dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 refugio2)
   goals met: 8 of 12
37. (leave box1 refugio2 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box1) (box-has box1 comida)
   added: (at-box box1 refugio2) (free dron1-der) (person-has person2 comida)
   goals met: 9 of 12
38. (move refugio2 refugio9 dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 refugio9)
   goals met: 9 of 12
39. (leave box8 refugio9 dron1-izq dron1 person11 medicina)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 medicina)
   added: (at-box box8 refugio9) (free dron1-izq) (person-has person11 medicina)
   goals met: 10 of 12
40. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 10 of 12
41. (pick box7 deposito dron1-der dron1)
   deleted: (at-box box7 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box7)
   goals met: 10 of 12
42. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 10 of 12
43. (leave box7 refugio2 dron1-der dron1 person2 medicina)
   deleted: (carrying dron1 dron1-der box7) (box-has box7 medicina)
   added: (at-box box7 refugio2) (free dron1-der) (person-has person2 medicina)
   goals met: 11 of 12
44. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 11 of 12
45. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 11 of 12
46. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 11 of 12
47. (leave box6 refugio2 dron1-der dron1 person12 medicina)
   deleted: (carrying dron1 dron1-der box6) (box-has box6 medicina)
   added: (at-box box6 refugio2) (free dron1-der) (person-has person12 medicina)
   goals met: 12 of 12
